bench/results/20260715T134031Z/lumen.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/quentindequelen/Projects/Meilisearch/_side_projects/Lumen/.claude/worktrees/agent-a7117d19dfa6df216/bench/k6-added-latency.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * load: 50 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 549 complete and 0 interrupted iterations
load   [   3% ] 50 VUs  01.0s/30s

running (0m02.0s), 50/50 VUs, 5659 complete and 0 interrupted iterations
load   [   7% ] 50 VUs  02.0s/30s

running (0m03.0s), 50/50 VUs, 11670 complete and 0 interrupted iterations
load   [  10% ] 50 VUs  03.0s/30s

running (0m04.0s), 50/50 VUs, 18465 complete and 0 interrupted iterations
load   [  13% ] 50 VUs  04.0s/30s

running (0m05.0s), 50/50 VUs, 26146 complete and 0 interrupted iterations
load   [  17% ] 50 VUs  05.0s/30s

running (0m06.0s), 50/50 VUs, 34105 complete and 0 interrupted iterations
load   [  20% ] 50 VUs  06.0s/30s

running (0m07.0s), 50/50 VUs, 41598 complete and 0 interrupted iterations
load   [  23% ] 50 VUs  07.0s/30s

running (0m08.0s), 50/50 VUs, 50115 complete and 0 interrupted iterations
load   [  27% ] 50 VUs  08.0s/30s

running (0m09.0s), 50/50 VUs, 57360 complete and 0 interrupted iterations
load   [  30% ] 50 VUs  09.0s/30s

running (0m10.0s), 50/50 VUs, 62875 complete and 0 interrupted iterations
load   [  33% ] 50 VUs  10.0s/30s

running (0m11.0s), 50/50 VUs, 67854 complete and 0 interrupted iterations
load   [  37% ] 50 VUs  11.0s/30s

running (0m12.0s), 50/50 VUs, 72754 complete and 0 interrupted iterations
load   [  40% ] 50 VUs  12.0s/30s

running (0m13.0s), 50/50 VUs, 75676 complete and 0 interrupted iterations
load   [  43% ] 50 VUs  13.0s/30s

running (0m14.0s), 50/50 VUs, 81520 complete and 0 interrupted iterations
load   [  47% ] 50 VUs  14.0s/30s

running (0m15.0s), 50/50 VUs, 88296 complete and 0 interrupted iterations
load   [  50% ] 50 VUs  15.0s/30s

running (0m16.0s), 50/50 VUs, 96412 complete and 0 interrupted iterations
load   [  53% ] 50 VUs  16.0s/30s

running (0m17.0s), 50/50 VUs, 105239 complete and 0 interrupted iterations
load   [  57% ] 50 VUs  17.0s/30s

running (0m18.0s), 50/50 VUs, 112857 complete and 0 interrupted iterations
load   [  60% ] 50 VUs  18.0s/30s

running (0m19.0s), 50/50 VUs, 121397 complete and 0 interrupted iterations
load   [  63% ] 50 VUs  19.0s/30s

running (0m20.0s), 50/50 VUs, 130199 complete and 0 interrupted iterations
load   [  67% ] 50 VUs  20.0s/30s

running (0m21.0s), 50/50 VUs, 138653 complete and 0 interrupted iterations
load   [  70% ] 50 VUs  21.0s/30s

running (0m22.0s), 50/50 VUs, 144693 complete and 0 interrupted iterations
load   [  73% ] 50 VUs  22.0s/30s

running (0m23.0s), 50/50 VUs, 150171 complete and 0 interrupted iterations
load   [  77% ] 50 VUs  23.0s/30s

running (0m24.0s), 50/50 VUs, 159311 complete and 0 interrupted iterations
load   [  80% ] 50 VUs  24.0s/30s

running (0m25.0s), 50/50 VUs, 167831 complete and 0 interrupted iterations
load   [  83% ] 50 VUs  25.0s/30s

running (0m26.0s), 50/50 VUs, 176876 complete and 0 interrupted iterations
load   [  87% ] 50 VUs  26.0s/30s

running (0m27.0s), 50/50 VUs, 185661 complete and 0 interrupted iterations
load   [  90% ] 50 VUs  27.0s/30s

running (0m28.0s), 50/50 VUs, 195230 complete and 0 interrupted iterations
load   [  93% ] 50 VUs  28.0s/30s

running (0m29.0s), 50/50 VUs, 202979 complete and 0 interrupted iterations
load   [  97% ] 50 VUs  29.0s/30s

running (0m30.0s), 50/50 VUs, 210139 complete and 0 interrupted iterations
load   [ 100% ] 50 VUs  30.0s/30s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(99)<50' p(99)=98.91ms


  █ TOTAL RESULTS 

    checks_total.......: 210256  6998.945478/s
    checks_succeeded...: 100.00% 210256 out of 210256
    checks_failed......: 0.00%   0 out of 210256

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=7.07ms min=352µs    med=3.95ms max=665.27ms p(90)=8.06ms p(95)=11.41ms p(99)=98.91ms
      { expected_response:true }...: avg=7.07ms min=352µs    med=3.95ms max=665.27ms p(90)=8.06ms p(95)=11.41ms p(99)=98.91ms
    http_req_failed................: 0.00%  0 out of 210256
    http_reqs......................: 210256 6998.945478/s

    EXECUTION
    iteration_duration.............: avg=7.12ms min=381.91µs med=3.99ms max=676.58ms p(90)=8.12ms p(95)=11.5ms  p(99)=99.01ms
    iterations.....................: 210256 6998.945478/s
    vus............................: 50     min=50          max=50
    vus_max........................: 50     min=50          max=50

    NETWORK
    data_received..................: 123 MB 4.1 MB/s
    data_sent......................: 50 MB  1.7 MB/s



running (0m30.0s), 00/50 VUs, 210256 complete and 0 interrupted iterations
load ✓ [ 100% ] 50 VUs  30s